{
  "about": {
    "title": "About me",
    "description": ["Hello, my name is Ícaro Xavier, a ", "Front-end Developer", ", passionate about technology and what I do. In February 2021, I had my first opportunity to work for a company in the field, and since then I haven't stopped, always working, studying, and improving in the area."
    ]
  },
  "experiences": {
    "title": "Professional Experiences",
    "rav": {
      "title": "RAV Tecnologia",
      "function": "Full-stack",
      "role": "Intern",
      "period": "02/2021 ~ 09/2021"
    },
    "embrapii": {
      "title": "EMBRAPII",
      "function": "Front-end",
      "role": "College Scholarship Holder",
      "period": "07/2021 ~ 04/2022"
    },
    "certare": {
      "title": "Certare Engenharia & Consultoria",
      "function": "Full-stack",
      "role": "Entry-level",
      "period": "10/2021 ~ 09/2022"
    },
    "omie": [
      {
        "title": "Omie",
        "function": "Full-stack",
        "role": "Junior",
        "period": "04/2022 ~ 09/2022"
      },
      {
        "title": "Omie",
        "function": "Full-stack",
        "role": "Mid-level",
        "period": "10/2022 ~ 03/2023"
      }
    ],
      "soluevo": {
      "title": "Soluevo",
      "function": "Front-end",
      "role": "Mid-level",
      "period": "03/2023 ~ present"
    }
  },
  "timeline": {
    "title": "Timeline",
    "06/2001": "I was born in Fortaleza - Ceará, Brazil.",
    "02/2021": "Started my first job in the field as an intern at RAV Tecnologia",
    "07/2021": "Joined the Colono project of EMBRAPII and Polo de Inovação do IFCE.",
    "09/2021": "Completed the internship at RAV Tecnologia.",
    "10/2021": "Started working at Certare Engenharia & Consultoria.",
    "04/2022-1": "Completed the Colono project of EMBRAPII and Polo de Inovação do IFCE.",
    "04/2022-2": "Started working at Omie, within G-click.",
    "03/2023-1": "Finished my collaboration at Omie to accept another opportunity.",
    "03/2023-2": "Started working at Soluevo, a consulting company, currently allocated in a European fintech."
  },
  "hobbies": {
    "title": "Hobbies",
    "description": "In my free time, you'll probably find me playing a game, taking a walk with my dog, studying the latest trends in the field, going for a drive to a new place, or watching a series, eager to find out what happens. That is if I haven't recently discovered a topic that interests me, because I only stop when I've devoured everything."
  },
  "projects": {
    "title": "Personal Projects",
    "github": "Link to GitHub repository",
    "madeireira-geovane": {
      "description": "A lead generation landing page developed entirely by me as a Freelancer job."
    },
    "better-date-functions": {
      "description": "My first JavaScript library to assist in the development of systems that manipulate dates, providing various ready-made functions to obtain details about days, months, and years."
    },
    "reminder-task-manager": {
      "description": "My first React project, which was the challenge I received to secure my internship. It's a Kanban-like application with synchronized drag and drop using Firebase and authentication as well. It was quite challenging, but it proved to me that with enough research, we can achieve anything."
    },
    "moRANGO": {
      "description": "This project is a Flutter application that aims to search for recipes using ingredients that you already have at home or plan to buy. I developed it with my college colleagues as part of an Object-Oriented Programming course project."
    },
    "teste-omie": {
      "description": "This was the project I developed for the Omie selection process, in which I was approved. I used the Angular framework for the front-end and developed a back-end with Spring Boot (JAVA)."
    },
    "portfolio": {
      "description": "This is my portfolio, developed with Next.js and TailwindCSS, with the aim of showcasing some of my work and skills."
    },
    "smart-recipe": {
      "description": "My first app using AI, developed with Next.js and TailwindCSS, consuming de OpenAI API to generate recipes based on ingredients that you already have at home or plan to buy."
    }
  },
  "contacts": {
    "title": "Contacts",
    "phone": "Phone"
  },
  "footer": {
    "copyright": "Ícaro Xavier. All rights reserved."
  }
}
